In [1]:
import math
import numpy as np
import pandas as pd
from sklearn import preprocessing as pp

In [2]:
df = pd.read_csv('train.csv')
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [3]:
df = df.drop(['Name', 'Ticket', 'Cabin'], axis=1)
df.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.0      1      0  26.000        S         1
1       3    male   NaN      0      0   8.050        S         0
2       2    male  39.0      0      0  26.000        S         0
3       3  female  29.0      0      4  21.075        S         0
4       3    male  25.0      0      0   7.050        S         0

In [4]:
genders = {'female': 0, 'male':1}
dataset = [df]
dataset

[     Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
 0         2  female  29.0      1      0  26.0000        S         1
 1         3    male   NaN      0      0   8.0500        S         0
 2         2    male  39.0      0      0  26.0000        S         0
 3         3  female  29.0      0      4  21.0750        S         0
 4         3    male  25.0      0      0   7.0500        S         0
 ..      ...     ...   ...    ...    ...      ...      ...       ...
 663       2  female  17.0      0      0  10.5000        S         1
 664       3    male   NaN      0      0   7.7500        Q         0
 665       3    male  32.0      0      0  56.4958        S         1
 666       3  female  22.0      0      0   9.8375        S         0
 667       3  female   NaN      1      0  15.5000        Q         1

 [668 rows x 8 columns]]

In [5]:
for data in dataset:
    data['Sex'] = data['Sex'].map(genders)
    
dataset

[     Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Survived
 0         2    0  29.0      1      0  26.0000        S         1
 1         3    1   NaN      0      0   8.0500        S         0
 2         2    1  39.0      0      0  26.0000        S         0
 3         3    0  29.0      0      4  21.0750        S         0
 4         3    1  25.0      0      0   7.0500        S         0
 ..      ...  ...   ...    ...    ...      ...      ...       ...
 663       2    0  17.0      0      0  10.5000        S         1
 664       3    1   NaN      0      0   7.7500        Q         0
 665       3    1  32.0      0      0  56.4958        S         1
 666       3    0  22.0      0      0   9.8375        S         0
 667       3    0   NaN      1      0  15.5000        Q         1

 [668 rows x 8 columns]]

In [6]:
embarked = {'S': 0, 'Q': 1, 'C': 2}
dataset = [df]
dataset

[     Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Survived
 0         2    0  29.0      1      0  26.0000        S         1
 1         3    1   NaN      0      0   8.0500        S         0
 2         2    1  39.0      0      0  26.0000        S         0
 3         3    0  29.0      0      4  21.0750        S         0
 4         3    1  25.0      0      0   7.0500        S         0
 ..      ...  ...   ...    ...    ...      ...      ...       ...
 663       2    0  17.0      0      0  10.5000        S         1
 664       3    1   NaN      0      0   7.7500        Q         0
 665       3    1  32.0      0      0  56.4958        S         1
 666       3    0  22.0      0      0   9.8375        S         0
 667       3    0   NaN      1      0  15.5000        Q         1

 [668 rows x 8 columns]]

In [7]:
for data in dataset:
    data['Embarked'] = data['Embarked'].map(embarked)

In [8]:
df.head()

   Pclass  Sex   Age  SibSp  Parch    Fare  Embarked  Survived
0       2    0  29.0      1      0  26.000       0.0         1
1       3    1   NaN      0      0   8.050       0.0         0
2       2    1  39.0      0      0  26.000       0.0         0
3       3    0  29.0      0      4  21.075       0.0         0
4       3    1  25.0      0      0   7.050       0.0         0

In [9]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Fare          0
Embarked      1
Survived      0
dtype: int64

In [10]:
df.Embarked.fillna(0, inplace=True)

In [11]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Fare          0
Embarked      0
Survived      0
dtype: int64

In [12]:
mean = df.Age.mean()
df.Age.fillna(mean, inplace=True)

In [13]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [14]:
df_test = pd.read_csv('test.csv')

In [15]:
df_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [16]:
df_test = df_test.drop(['Name', 'Ticket', 'Cabin'], axis=1)
df_test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       2    male   8.0      1      1  36.7500        S
1       1  female  49.0      0      0  25.9292        S
2       3    male   NaN      0      0   7.7375        Q
3       2  female  24.0      2      1  27.0000        S
4       1    male  36.0      0      0  26.2875        S

In [17]:
genders = {'female':0, 'male':1}
df_test['Sex'].replace(genders, inplace=True)
df_test.head()

   Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0       2    1   8.0      1      1  36.7500        S
1       1    0  49.0      0      0  25.9292        S
2       3    1   NaN      0      0   7.7375        Q
3       2    0  24.0      2      1  27.0000        S
4       1    1  36.0      0      0  26.2875        S

In [18]:
embarked = {'S': 0, 'Q':1, 'C':2}
df_test['Embarked'].replace(embarked, inplace=True)

In [19]:
df_test.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       2    1   8.0      1      1  36.7500       0.0
1       1    0  49.0      0      0  25.9292       0.0
2       3    1   NaN      0      0   7.7375       1.0
3       2    0  24.0      2      1  27.0000       0.0
4       1    1  36.0      0      0  26.2875       0.0

In [20]:
df_test.isnull().sum()

Pclass       0
Sex          0
Age         45
SibSp        0
Parch        0
Fare         0
Embarked     1
dtype: int64

In [21]:
df_test['Embarked'].fillna(0, inplace=True)
mean = df_test.Age.mean()
df_test['Age'].fillna(mean, inplace=True)
df_test.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [22]:
train_data = df.values
train_data.shape

(668, 8)

In [23]:
test_data = df_test.values
test_data.shape

(223, 7)

In [24]:
x_train = train_data[:, :-1]
y_train = train_data[:, -1]
x_train.shape, y_train.shape

((668, 7), (668,))

In [25]:
scaler = pp.StandardScaler()
scaler.fit(x_train)
x_train = scaler.transform(x_train)
x_test = scaler.transform(test_data)
# print(x_train)
print(x_test)

[[-3.56680918e-01  7.51267469e-01 -1.70280321e+00 ...  6.94117561e-01
   1.03461451e-01 -5.87892987e-01]
 [-1.56002866e+00 -1.33108386e+00  1.51439177e+00 ... -4.76767618e-01
  -1.35477405e-01 -5.87892987e-01]
 [ 8.46666826e-01  7.51267469e-01 -4.53892900e-04 ... -4.76767618e-01
  -5.37176352e-01  6.54868137e-01]
 ...
 [-1.56002866e+00 -1.33108386e+00 -9.96589681e-01 ... -4.76767618e-01
   1.69663741e+00  1.89762926e+00]
 [ 8.46666826e-01  7.51267469e-01  1.04358275e+00 ... -4.76767618e-01
  -5.65606207e-01 -5.87892987e-01]
 [-3.56680918e-01  7.51267469e-01  5.33539639e-01 ...  1.86500274e+00
  -1.33914039e-01 -5.87892987e-01]]

In [26]:
df = pd.DataFrame(x_train)
df['c']=1
x_train = df.values
df_test = pd.DataFrame(x_test)
df_test['c']=1
x_test = df_test.values
x_train.shape

(668, 8)

In [36]:
def step_gradient(points, learning_rate, m):
    m_slope = np.zeros(8)
    N = len(points)
    for i in range(N):
        x = points[i,:]
        y = y_train[i]
        for j in range(len(x)):
            s=[]
            for k in range(len(x)):
                s.append(x[k]*m[k])
            h = 1/ (1+ math.exp(-1*sum(s)))
            m_slope[j] += (-1/N)* (y - h) * x[j]

    new_m = m - learning_rate*m_slope
    
    return new_m

In [37]:
def predict(x3,m):
    y_p=[]
    for i in range(len(x3)):
        b=[]
        x = x3[i,:]
        for j in range(len(m)):
            b.append(m[j]*x[j])
        h = 1/ (1+ math.exp(-1*sum(b)))   
        if h>0.5:
            y_p.append(1)
        elif h<=0.5:
            y_p.append(0)    
    return(y_p)

In [38]:
def cost(points, m):
    total_cost = 0
    M = len(points)
    for i in range(M):
        x = points[i,:]
        y = y_train[i]
        b=[]
        for j in range(len(m)):
            b.append (m[j]*x[j])
        h = 1 / (1+ math.exp(-1*sum(b))) 
        #if sum(b) < 0:
            #h= 1 - 1/(1 + math.exp(sum(b)))
        #else:
            #h= 1/(1 + math.exp(-sum(b)))
        total_cost += (-1/M)* (y*(math.log(h))+((1-y)*(math.log(1-h))))
        #print(total_cost)
    return total_cost

In [39]:
def gd(points, learning_rate, num_iterations):
    m = np.zeros(8)
    for i in range(num_iterations):
        m = step_gradient(points, learning_rate, m)
    return m

In [55]:
def run():
    learning_rate = 0.1
    num_iterations = 500
    m = gd(x_train, learning_rate, num_iterations)
    slope = m
    y_pred = predict(x_test, slope)
    print(m)
    print(y_pred)
    np.savetxt("y_titanic.csv",y_pred,fmt='%.5f')

In [41]:
run()

[-0.86607655 -1.28723986 -0.48826995 -0.32829487 -0.13482588  0.07371549
  0.15063765 -0.50443527]
[0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0]